[
  {
    "heading": "API Consumption ",
    "name": "Cineplex",
    "discription": {
      "sentence": "This dynamic React web app, leveraging Tailwind CSS and custom hooks, provides a feature-rich movie browsing experience. It taps into the expansive MovieDB API to fetch and display film data rapidly with professional search and dark mode functions. Modern web development skills like declarative React components, reusable hooks, API integration, routing, and responsive design create a polished, scalable application."
    },
    "tech": ["React Router DOM", "Fetch API", "TailwindCSS", "Vite"],
    "image": "./images/cineplex.png",
    "classes": ""
  },
  {
    "heading": "Latest Project",
    "name": "Keeper App",
    "discription": {
      "sentence": "The frontend development was carried out using React, a popular JavaScript library for building user interfaces, coupled with Material UI to enhance the visual design and user experience.The backend, powered by Express Js, Mongoose, and MongoDB, ensures efficient data management.",
      "words": [
        { "name": "React", "link": "http://google.com" },
        { "name": "Material UI", "link": "http://google.com" },
        { "name": "Express Js", "link": "http://google.com" },
        { "name": "Mongoose", "link": "http://google.com" },
        { "name": "MongoDB", "link": "http://google.com" }
      ]
    },
    "tech": ["React", "Material UI", "Express Js", "Mongoose", "MongoDB"],
    "image": "./images/keeperApp.png",
    "classes": "reverse"
  },
  {
    "heading": "Bootcamp Project",
    "name": "Daily Journal",
    "discription": {
      "sentence": "Developed a daily journaling web application using server side rendering with Node.js and the Express framework to generate HTML pages and views leveraging the EJS template engine, along with crafting a RESTful API to create, read, update and delete journal entries from the database, employing plain CSS without the overhead of frameworks for simple and flexible styling."
    },
    "tech": ["NodeJs", "EJS", "Express Js", "Mongoose/MongoDB"],
    "image": "./images/dailyJournal.png",
    "classes": ""
  }
]
